{"articles": [{

    "heading": "David Letterman’s Netflix Talk Show Will Fill The Void His 'Late Show' Retirement Left Behind",
    "image": "https://typeset-beta.imgix.net/uploads/getty/2017/8/8/c0b57d78-92f5-4ee0-952c-0a23e80fd502-getty-488511697.jpg?w=740&h=444&fit=crop&crop=faces&auto=format&q=70&dpr=2",
    "author": "Danielle Jackson",
    "content": "When the longtime host of the Late Show retired from late night television in 2015, it probably left a gaping hole in your heart that you have yet to recover from. But don't worry anymore, because Netflix announced on Tuesday that Letterman is officially returning to television with a brand new series on the streaming platform.

According to a release from Netflix, the first season of Letterman’s new series, which hasn’t yet been named, will include six hour-long episodes. All of them will feature Letterman conducting long-form interviews with single guests and venturing outside of the studio for other more curiosity-based segments. As of now, the show doesn't have an exact release date, but fans can expect it to drop at some point in 2018.

Letterman made a name for himself as the longtime — 33 years, to be exact — host of NBC's Late Night and The Late Show on CBS, respectively. He officially signed off the air in 2015, and passed the torch over to Stephen Colbert in an episode that raked in nearly 14 million viewers.

Following the announcement of his return to television, Letterman said in a statement,

'I feel excited and lucky to be working on this project for Netflix. Here's what I have learned, if you retire to spend more time with your family, check with your family first. Thanks for watching, drive safely.'

The host's return to television really couldn't have come at a better time. Not-so-great political news can basically be expected almost every day, and lots of people look to late night talk shows for a bit of comedic relief. It'll be great to see how Letterman handles generating conversations around these topics using his blunt interviewing tactics.

But this is huge for Netflix as well, seeing as the streaming platform, which already has a handful of original series that have gained huge followings in recent years, is also trying to become its own force when it comes to talk shows, like Chelsea with Chelsea Handler and Bill Nye Saves the World. Netflix really couldn't have chosen a better host for their next series than David Letterman. ",
    "starter": "When the longtime host of the Late Show retired from late night television in 2015, it probably left a gaping hole in your heart that you have yet to recover from. But don't worry anymore, because Net...",
    "date": "2 hours ago"
  }, {
    "heading": "The Starbucks Horchata Almondmilk Frappuccino Is Here & It’s The Perfect End-Of-Summer Treat",
    "image": "https://typeset-beta.imgix.net/uploads/image/2017/8/8/24a5bdae-a90b-47b7-8804-b73bd42566ac-horchata_frappuccino_stylized_image.jpg?w=740&h=444&fit=crop&crop=faces&auto=format&q=70&dpr=2",
    "author": "Lucia Peters",
    "content": "Now is the time of year that I usually start thinking of “transitional” things: Transitional wardrobes, transitional foods, and so on and so forth. Gotta make the switch from sweltering summer to… well, probably equally sweltering fall as seamless as possible, right? And this year, we’ve got something new to add to the transitional treats menu: The Starbucks Horchata Almondmilk Frappuccino is now available at participating Sbux locations across the United States and Canada. Heck, and yes.

Exactly what horchata is varies depending on where you are; the kind of horchata you’ll get in Spain is very different than the kind of horchata you’ll get in Latin America — and even within Latin American countries, you’ll encounter a lot of variety. What most people in the United States probably think of as horchata is the kind typical of Mexico and Guatemala: A sweet, rice-based drink served chilled over ice that tastes of vanilla and cinnamon.

That’s the type of horchata on which Starbucks’ new Frappuccino offering is based. According to the drink’s fact sheet, this “cool, creamy Frappuccino starts with almondmilk, coffee, cinnamon dolce syrup and ice blended together.” And, since Frappuccino toppings have become almost as notable as the Frappuccinos themselves (hi there, 'sweet pink and sour blue powder'), this one has a few spectacular finishing touches, as well: Whipped cream, a swirl of caramel, and cinnamon and sugar sprinkles top the whole thing off. A Tall, 12-ounce Horchata Almondmilk Frappuccino has about 70mg of caffeine. What makes it the perfect transitional drink? Its frosty composition and its spicy flavor profile. I don’t know about you, but I’m still in that space of time where just the idea of drinking something hot makes me start to sweat; as a result, I’m constantly reaching for cool, iced drinks instead. That said, though, fall is my favorite time of year, a large part of which has to do with all of the tasty warming spices that tend to emerge during September, October, and November. Happily, the Horchata Almondmilk Frappuccino brings together all of those things — as the fact sheet puts it, “The Starbucks Horchata Almondmilk Frappuccino is the perfect beverage to end the summer and welcome fall. The creamy and cool texture — ideal for warm August days — is complemented by sweet caramel and warm spice flavors of cinnamon which hint that fall is near.”

The Starbucks Horchata Almondmilk Frappuccino is available at participating Starbucks stores in the United States and Canada starting on Aug. 8; it’s only going to be around for a limited time, though — as the drink’s menu page puts it, it’s “delightful during the warmer months, and like summer, not here for long” — so grab it while you can.

Not a coffee person? Not to worry; you can also pick up a pina colada-esque Teavana Shaken Iced Pineapple Black Tea Infusion instead. Or give the Iced Cascara Coconut Milk Latte a shot — that’s an option, too. Which to get? It’s the most delicious of conundrums. And, I mean, there’s also nothing that says you can’t go ahead and get all three. YOLO, right? Or…something.

Bottoms up!",
    "starter": "Now is the time of year that I usually start thinking of “transitional” things: Transitional wardrobes, transitional foods, and so on and so forth. Gotta make the switch from sweltering summer to… well...",
    "date": "4 hours ago"
  }]
}
